[
  {
    "type": "pro",
    "name": "How to run SwiftPM Tests",
    "link": "https://tech.masters3d.com/how-to-run-swiftpm-tests-135b6538ee08?source=rss----3dd52373a16---4",
    "description": [
      "swift",
      "swift-package-manager",
      "programming"
    ],
    "date": "2016-12-17T02:18:45.329Z",
    "media": {
      "source": "First of all make sure you have latest trunk snapshot from swift.org  and are<br>using it:<br><br>$ export TOOLCHAINS=swift<br><br>$ xcrun — find swift<br><br>/Library/Developer/Toolchains/swift-DEVELOPMENT-SNAPSHOT-2016–12–15-a.xctoolchain/usr/bin/swift<br><br>Clone Swift Package Manager from https://github.com/apple/swift-package-manager<br><br>This will build and test swiftpm on command line:<br><br>$ Utilities/bootstrap test<br><br>If you prefer Xcode:<br><br>$ Utilities/bootstrap — generate-xcodeproj<br><br>$ open SwiftPM.xcodeproj<br><br>$ cmd + u<br><br>Source:<br><br>https://lists.swift.org/pipermail/swift-build-dev/Week-of-Mon-20161212/000790.html<br><br>[https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=135b6538ee08]<br>--------------------------------------------------------------------------------<br><br>How to run SwiftPM Tests  was originally published in Tech Masters3d  on Medium,<br>where people are continuing the conversation by highlighting and responding to<br>this story.",
      "elementType": "article",
      "id": "https://tech.masters3d.com/how-to-run-swiftpm-tests-135b6538ee08?source=rss----3dd52373a16---4",
      "provider": "medium"
    }
  },
  {
    "type": "pro",
    "name": "2016: One Year of iPad Pro 12.9\"",
    "link": "https://tech.masters3d.com/2016-one-year-of-ipad-pro-12-9-6c69b03d838b?source=rss----3dd52373a16---4",
    "description": [
      "ipad-pro",
      "mobile",
      "ios",
      "apple"
    ],
    "date": "2016-11-14T21:57:12.545Z",
    "media": {
      "source": "I picked up my iPad Pro 12.9\" 128GB Wifi + Cellular Model the morning of Nov<br>11th 2015 at my local Apple store. It felt like Christmas had come early. I<br>bought the case  ahead of time so I had it ready when I picked up the iPad.<br><br>THe #ipadPro actually has better specs for the price vs #surface4<br><br> —@masters3d<br><br>Not bad #iPadPro with T-Mobile sim, 2% left from weekend use<br><br> —@masters3d<br><br>I wanted to use the iPad mainly for personal use during the weekend. I ended up<br>using the iPad mostly after work when I want to watch a show or a movie with my<br>wife. I love how loud the speakers are. The only snag I had was with the the<br>iPad not waking up after a full charger  but that got fixed pretty fast.<br><br>I looked at hardware mobile keyboards but I did not really like any of the<br>keyboards. Even the Apple smart keyboard did not feel compelling for me to get<br>so I decided to skip the portable keyboard. I bought a portable case for my old<br>Apple bluetooth keyboard instead. Not as convenient as something that is already<br>attached but it works for me.<br><br>[https://cdn-images-1.medium.com/max/1024/1*keB7ISkVkfTvmvZrnwGU9A.jpeg]Most of<br>the time I actually find the on screen keyboard to be good enough to write<br>something quick but I can not see myself writing a novel on a glass keyboard.<br><br> * The screen gets really dirty if you are typing on the glass.<br> * Most iPad cases do not accommodate the space bar well. I had to make a cut on<br>   my case so that I could hit the space bar with my thumb.<br> * There is no tactile feedback for the onscreen keyboard. I am not sure how 3d<br>   touch  could help here but if Apply could figure that out, I am sold.<br><br>[https://cdn-images-1.medium.com/max/1024/1*MelhYclVDfEr_IzZUPex0g.jpeg]ipadpro<br>probably the best ebook reader.<br><br> —@masters3d<br><br>The iPad did start to eat into my iPhone and macbook pro usage. I found myself<br>picking up my iPad when I wanted to read browsed the internet if I was eating or<br>reach a PDF in full screen.<br><br>I don’t not use the iPad to take notes even though I do own the apple pencil. I<br>think the main reason why I do not use it is because I can’t get tips for the<br>pencil. I don’t not have the prettiest hand writing and writing on glass does<br>not help my writing come out better. I wish I could get tips that will make it<br>feel like I am writing on paper or add some kind of resistance to the stroke. I<br>do feel that Apple missed an opportunity by not including 3d touch on the actual<br>pencil. Imagine being able to feel that you are actually pushing down a button<br>on the iPad.<br><br>Right now the iPad to me is just a big phone with lots of battery. I sometimes<br>use it as a mobile hotspot for my laptop.<br><br>I love my iPad. I wish I could pair it to my apple watch so I would not need to<br>carry a phone but that may be pushing it.<br><br>I’ve been thinking about getting a physical keyboard lately. Aside from Apple’s<br>Smart Keyboard, I have not found something that is not too bulky. I don’t plan<br>to replace my laptop with this iPad but I do wish that the input story for the<br>iPad was better. I hope for a future where I could type on screen and have that<br>feel natural.<br><br>[https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=6c69b03d838b]<br>--------------------------------------------------------------------------------<br><br>2016: One Year of iPad Pro 12.9\"  was originally published in Tech Masters3d  on<br>Medium, where people are continuing the conversation by highlighting and<br>responding to this story.",
      "elementType": "article",
      "id": "https://tech.masters3d.com/2016-one-year-of-ipad-pro-12-9-6c69b03d838b?source=rss----3dd52373a16---4",
      "provider": "medium"
    }
  },
  {
    "type": "pro",
    "name": "Udacity the new ITT Tech?",
    "link": "https://tech.masters3d.com/udacity-the-new-itt-tech-ce26018c3f2?source=rss----3dd52373a16---4",
    "description": [
      "udacity",
      "college",
      "tech-jobs",
      "itt-tech",
      "education"
    ],
    "date": "2016-11-03T19:52:43.371Z",
    "media": {
      "source": "https://medium.com/media/706043f51b3e831c712ded61a002dbee/href<br>https://medium.com/media/719c67ecf7476e04aae2d4b32828bce9/hrefUdacity came out<br>with a really cool commercial  that actually worried me. I’ve seen commercials<br>like this before with a lot of promises  about jobs. I remember watching these<br>types of commercials  on TV about ITT Tech and thinking “That is exactly what I<br>want”. ITT was never an accredited school but it also promised people jobs for<br>the future. I ended up going to ITT Tech Seattle, WA / Rancho Cordova, CA for<br>about a year before it shut down. This little adventure costed me around $10k. I<br>didn’t learn anything marketable at that school. I always say that I just paid<br>$10k to learn that I can learn by myself.<br><br>The reality is that the for profit school’s only goal was to make money for<br>their investors. It doesn’t matter if the students are not able to find jobs in<br>their field. It doesn’t matter if most students work dead end jobs waiting for a<br>tech job that never arrives. ITT Tech promise of tech jobs was never fulfilled.<br>I have a friend from HS who graduated with a BA degree in game creation but<br>could not get a job with the degree, the price tag was $50k.<br><br>Udacity is a  fraction of the cost  of ITT but I don’t believe that this will<br>last. I expect Udacity to move to the bootcamp  price model. They already moved<br>from a $400 minimum for a nano degree to 3 x $800 = $2,400. I don’t expect them<br>to back down from that formula. I don’t necessary think this is a bad thing<br>because that is still way cheaper than other bootcamps.<br><br>“You don’t sell products, benefits or solutions — you sell feelings.” — Trump<br>UniversityUdacity’s commercial starts by trying to imitate Apple’s iconic<br>commercial Here is to the Crazy ones. I actually like this part. The parts that<br>don’t sit well with me are the future jobs scenes. It makes me feel like they<br>are selling me feelings instead of the actual education  to get a job. The blue<br>theme logo strikes a similarity to the way ITT used to close their commercials.<br>I don’t question the effectiveness of the commercial. I believe it is going to<br>be a big hit. Perhaps my biggest issue is the target audience: Already Software<br>Engineers who are looking for a change. There is nothing about the commercial<br>that makes me think that I need to be a software engineer to take full advantage<br>of their programs. Udacity’s Model seems to be. If you are a software engineer<br>who wants to do Android development then taking their nano degree is a no<br>brainer. Maybe you always dreamed of working with artificial intelligence? Sure.<br>They have a  nano degree for that too. but good luck trying to get an actual job<br>if you are not already a  Software Engineer.<br><br>[https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=ce26018c3f2]<br>--------------------------------------------------------------------------------<br><br>Udacity the new ITT Tech?  was originally published in Tech Masters3d  on<br>Medium, where people are continuing the conversation by highlighting and<br>responding to this story.",
      "elementType": "article",
      "id": "https://tech.masters3d.com/udacity-the-new-itt-tech-ce26018c3f2?source=rss----3dd52373a16---4",
      "provider": "medium"
    }
  },
  {
    "type": "pro",
    "name": "Udacity and the programmer’s dream",
    "link": "https://tech.masters3d.com/udacity-and-the-programmers-dream-bf2fb939da0?source=rss----3dd52373a16---4",
    "description": [
      "ios-app-development",
      "computer-science",
      "swift-programming",
      "programming",
      "udacity"
    ],
    "date": "2016-10-25T17:42:59.088Z",
    "media": {
      "source": "[https://cdn-images-1.medium.com/max/1024/1*D01pq1EDogbP70i1RGDsHg.jpeg]Senior<br>High School Project. Notice programmer is misspelled :)I’ve always wanted to be<br>a computer programmer. In 2003, this was part of the plan. During my freshman<br>year in college I found out very quickly that perhaps I didn’t want to be a<br>programmer because I felt that I did not have the capacity. I didn’t really want<br>to take chemistry and biology; I found physics to be too abstract for a subject<br>that was supposed to be about our physical world. I wanted to do creative things<br>that computer programs would allow me to do so I transferred to a community<br>college to pursue Digital Media. I didn’t know it then but I still wanted to be<br>a computer programmer but I thought it was too hard because of my experience<br>during freshman year. I kept finding ways to use programming. From editing xml<br>for Final Cut Pro timelines, to adding simple scripts to After Effects to make<br>objects fly, to creating 3d building structures in Modo, to being able to create<br>a mini program inside Excel. In 2013 I started watching some of Udacity python <br>courses in order to learn backend web programing.<br><br>[https://cdn-images-1.medium.com/max/1024/1*V-hggwtjhy8rZ-flZcVGug.png]I would<br>find any excuse to use python at my work so I started working on a web app that<br>would create xml files with pictures embedded in them. Python was one of those<br>languages that I could actually understand. I really wanted to be able to make<br>apps for the iPhone but I could not get my head around ObjectiveC. In 2014 Apple<br>launches Swift  and I was literately jumping up and down of happiness because I<br>could actually understand Swift. Swift made sense to me. I started to follow<br>people on twitter in order to learn everything there was to know about Swift.<br>When Swift was open sourced, I followed every proposal to learn every detail<br>about the language. I picked up Java, then I properly learned Objective-c  which<br>helped me picked up C++. It was incredible being able to describe C++ templates<br>in terms of Swift generics. I made my first game iOS app  in 2014. It was a<br>silly little breakout app but to me it was like seeing a baby crawl for the<br>first time. My first pull request was not even a pull request  but me trying to<br>figure out how to start a conversation about issues I was having implementing my<br>game. In 2015 I started to implement exercises for the open  source project<br>Excersism.  I learned about open source and community there. I had no idea how<br>to use the git command line. I was scared of the command line but Katrina Owen <br>taught me a couple of tricks here and there and she was patient even when I<br>completely messed up a PR .<br><br>[https://cdn-images-1.medium.com/max/1024/1*CqjmB75poXu0K9uLUhoYWw.jpeg][https://cdn-images-1.medium.com/max/1024/1*6SPsMrxnC42zY0crg0fYMg.jpeg][https://cdn-images-1.medium.com/max/1024/1*XKyNN9EIw_HXQ7zwn-NDyQ.jpeg]<br>Udacity came out with their nanodegrees so I started by getting the Beginning<br>iOS nanodegree and six months later I got the iOS developer Nanodegree. I even<br>shipped my first regex bug on a popular swift lint library. I have all these <br>iOS<br>apps  and even though Udacity says I am an iOS developer; most companies would<br>never hire me.<br><br>Sure I have a college degree  but it is not a technical degree. Do I know Agile?<br>Of course, I am a certified scrum master and a product owner  but I don’t have<br>the experience so I have never gotten a call back for a scrum master position.<br>Udacity is perfect for people who already have engineering degrees. I think<br>employers see the nanodegree like a concentration for the engineering degree. I<br>owe a lot to Udacity but unfortunately a Udacity certificate does not help me<br>get a job unless I already have a technical degree. I wish Udacity would build a<br>post-graduate B.S. in Computer Science like Oregon State is offering now ;<br>Instead Udacity offers a MSCS  with Georgia Tech that requires you to have a lot<br>of classes in CS in order to be accepted.<br><br>[https://cdn-images-1.medium.com/max/1004/1*w5iDTt68ovPbFWV9skJ5rA.png]My<br>rejection letter from Georgia Tech MSCSOf course there are some schools that<br>offer Master of Software Engineering  degrees that are meant for people who<br>already have a tech degree. It is possible to obtain a MSE degree with out first<br>getting a tech degree, but then you wont be ready to pass the technical<br>interview. Udacity could offer a pathway to Georgia Tech’s graduate degree for<br>people who do not have tech degrees. Udacity did try to offer classes for<br>undergraduate courses with San Jose state but that did not pan out. Recently<br>I’ve seen some classes on Udacity that do address the lack of data structures<br>and algorithms education. This content should help the student pass the <br>technical interview  but with out a tech degree, most Udacity graduates will not<br>get a call for the interview. If Udacity can convince companies like google to<br>provide the Android education  with them, why not ask google to let them create<br>a “techdegree” that is able to convince recruiters that a person is a capable<br>technical developer?<br><br>[https://cdn-images-1.medium.com/max/1024/1*ptmyixLs5ve_0VfbrnlZ0w.png]Oregon<br>State Online DegreeThe techdegree could be like a certification that some colleges offer  in order<br>to allow somebody to apply for a graduate CS program. These are graduate level<br>accredited classes that close the gap on a person CS education. Unfortunately<br>these graduate classes are also very expensive. Udacity could either parter up a<br>college to offer a regular post-baccalaureate  CS program, offer a remedial CS<br>certificate for people interested in MSCS or make their own techdegree with the<br>backing of Google and Facebook.<br><br>Udacity’s techdegree should teach:<br><br> * CS 225 — Discrete Structures in Computer Science<br> * CS 261 — Data Structures<br> * CS 325 — Analysis of Algorithms<br> * CS 344 — Operating Systems<br><br>Udacity does teach the contents of some of these classes but they are part of<br>the graduate level track for the Master degree. What ever solution Udacity<br>provides, it needs to have the HR backing of companies like Google and Facebook.<br>If these companies do not allow their hiring people to accept these credentials<br>then these are just as good as ITT Tech. I am not alone when it comes to feeling<br>the algorithm discrimination. Udacity can help tech companies change their<br>hiring practices by providing what these companies’ HR departments want. If you<br>are in Seattle and need help with an iOS project, let me know. Perhaps there<br>is hope.<br><br>QA Game Tester\" is the #Seattle equivalent of flipping burgers at McDonalds.<br><br> —@masters3d<br><br>[https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=bf2fb939da0]<br>--------------------------------------------------------------------------------<br><br>Udacity and the programmer’s dream  was originally published in Tech Masters3d <br>on Medium, where people are continuing the conversation by highlighting and<br>responding to this story.",
      "elementType": "article",
      "id": "https://tech.masters3d.com/udacity-and-the-programmers-dream-bf2fb939da0?source=rss----3dd52373a16---4",
      "provider": "medium"
    }
  }
]